nerd_food/start-ups_at_the_gate_trends_in_the_technology_industry.org
#+title: Nerd Food: Start-ups at the Gate: Trends in the Technology Industry
#+author: Marco Craveiro
#+options: num:nil author:nil toc:nil
#+bind: org-html-validation-link nil
#+HTML_HEAD: <link rel="stylesheet" href="../css/tufte.css" type="text/css" />

[[file:../index.org][Back to home page]].

Thursday, September 25, 2014

It is very difficult to convey the vast scale at which the largest
Internet companies operate. To make matters worse, we are fast
becoming immune to statistics such as one billion users and five
trillion searches per day, surrounded as we are by a sea of large
numbers on a daily basis. Having said that, any Information Technology
(IT) professional worth his or her salt cannot help but feel in awe at
what has been achieved. It is not just that these platforms are big;
they work at a scale that is qualitatively different from anything
that has come before. The sort of things that are possible at this
scale are mind-boggling, and we have only begun to scratch the
surface[fn:1].

[fn:1] As one of many examples, see Google Flu Trends. It is a
predictor of outbreaks of the flu virus, with a prediction rate of
about 97%. For a more comprehensive - if somewhat popular - take on
the possibilities of large data sets, see Big Data: A Revolution That
Will Transform How We Live, Work and Think. For a very different
take - highliting the dangers of Big Data - see Taleb's views on the
ever decreasing noise to signal ratio: The Noise Bottleneck or How
Noise Explodes Faster than Data.


Perhaps even more revolutionary is the fact that these companies have
made it possible for anyone to start thinking about data in the same
way as they do, and to start handling it using the very same tools
they use. There is now a never-ending archive of the very best
large-scalability tools, all available for free, with code that anyone
can inspect, modify and optimise to meet their specific
requirements. The tools come with a wealth of practical documentation
on how to put solutions together - either freely available or at
low-cost - and with a number of passionate user communities that
provide expert advice and are eager to accept modifications.

The ecosystem they have created is truly staggering. As an example,
Facebook has open sourced almost 10M lines of code to date. Twitter,
Google and LinkedIn are not far behind[fn:2]. It is also important to
notice that non-Internet companies are making extremely large
contributions too, such as Microsoft and IBM. All told, the overall
pool of open source code is growing exponentially, as demonstrated by
a 2008 study. In most cases, these are full-fledged products, tested
in the most challenging production conditions imaginable. Of course,
one must also not forget the contributions made to projects that are
not under company control such as the Linux Kernel, the Apache
web-server and the GNU Compiler GCC.

[fn:2] In fact, by some measures, Google has contributed several times
that amount. For one such take, see Lauren Orsini's article.


In order to understand why modern start-ups provide such a compelling
financial case, one must first understand how we got to the amazing
technology landscape we have today. To do so, we shall divide recent
technology history into eras, and explain each era's contribution. We
will then focus on modern start-ups, and explain how this model can be
deployed to a large gamut of industries and in particular to the
financial sector.

