nerd_food/start-ups_at_the_gate_trends_in_the_technology_industry.org
* First Era: Dot-com Bubble

Silicon Valley was and still is the world's start-up factory so,
unsurprisingly, it was ground zero for the start-up revolution that
took place at the end of the nineties. It would eventually be known as
The Dot-com Bubble. Most people remember those days as a heady time,
where each and every idea was packaged as a website and sold for
millions or in some cases billions of dollars. Of course, we all had a
steep price to pay when the bubble burst - an extinction event that
decimated the young Internet sector and IT companies in general.

There is however another way to look at this bubble: it was a gigantic
experiment to determine whether there were successful business models
to be found in the large scale of the Internet. Whilst much
mal-investment occurred, the bubble still produced or pushed forward
several of the giants of today such as Google, Amazon and Yahoo.

Most of these companies share a similar technology story. Originally
faced with a dearth of investment but with bright young engineers,
they found themselves relying on Free and Open Source Software (FOSS)
and cheap, off-the shelf hardware. Once they became big enough, it
just didn't make sense to replace all of that infrastructure with
software and hardware supplied by commercial vendors.

This turn of events was crucial. If these companies had had larger
budgets and less skilled engineers, they would have relied on the
cutting edge technology of the time. The short-term gain would reveal
itself as long term pain, for their ability to scale would be
inevitably restricted. In addition, many of the business models
wouldn't have worked due to this cost structure[fn:3]. As it was,
since they couldn't even afford the relatively cheap licences of
commercial software, they had to make do with what was available for
free.

[fn:3] 3 As an example, it was common practice for vendors to charge
according to the number of processors, users and so on. Many of the
better funded start-ups made use of technology from Cisco, Sun, Oracle
and other large commercial vendors, but companies that did so are not
very well represented in the population that survived the dot-com
bubble, and they are not represented at all in the 2014 Fortune 500
list. Google, Amazon and E-Bay are the only Fortune 500 companies from
that crop and they all relied to a very large extent on in-house
technology. Note though that we are making an empirical argument here
rather than a statistical one, both due to the lack of data available,
as well as concern for Survivorship Bias.


The engineers in these companies - and many others that didn't make it
through the dot-com filter - spent countless hours improving FOSS
tools and gave back much of these improvements to communities such as
Linux, MySQL, Apache, GCC and so on. However, they kept private the
plumbing work done to manage the large cluster of cheap machines, as
well as the domain related technology - in industry-speak, the Secret
Sauce.

By the time the dot-com bubble had run its course and the dust
settled, the landscape looked as follows:

- A model had been created whereby a small number of engineers could
  bootstrap an Internet-based company at very low cost, serving a
  small number of users initially.
- The model had been stretched to very large numbers of users and had
  been found to scale extremely well; as the business proved itself
  and investment came in, it was possible increase the size of the
  computing infrastructure to cope with demand.
- Because of the open nature of the technologies involved, the ideas
  became widespread over the internet.
- The basic high-scalability FOSS stack - ready for start-ups - was
  born; the Data Centre, where large amounts of computing are
  available at low cost, soon followed. It would eventually morph into
  the Cloud.

