nerd_food/start-ups_at_the_gate_trends_in_the_technology_industry.html

<div id="outline-container-orgb4cd8b1" class="outline-2">
<h2 id="orgb4cd8b1">Second Era: Social Media</h2>
<div class="outline-text-2" id="text-orgb4cd8b1">
<p>
The bursting of the dot-com bubble did not dampen the entrepreneurial
spirits, but it did dry up all the easily available capital and thus
pushed the aspiring start-ups to be ever more frugal. In addition, VCs
started to look for better ways to evaluate prospects. The problem
they faced was no different from what they had faced during the
dot-com days: how to figure out the potential of a company with no
defined business model and nothing else to compare it against.
</p>

<p>
Google had proved comprehensively that the traditional valuation
methods did not make sense in the world of start-ups. After all, here
was a company which it's founders couldn't sell for 1M USD and yet a
few years later was generating billions of dollars in revenues. Very
few saw this coming. VCs were keen not to make the same mistake with
the next Google<label for="4" class="margin-toggle sidenote-number"></label><input type="checkbox" id="4" class="margin-toggle"/><span class="sidenote">
For one of many takes on the attempt to sell Google, see When
Google Wanted To Sell To Excite For Under 1 Million~— And They
Passed. To get a flavour of how poorly understood Google's future was
as late as 2000, see Google Senses That It's Time to Grow Up. Finally,
the success story is best told by the growth of revenues between 2001
and 2003 - see Google's 2003 Financial Tables.
</span>.
</p>

<p>
So it was that a system to determine potential by proxy emerged over
the years, using indicators such as the size of the user base, time
spent by users on the platform and so on - effectively, any attribute
that was deemed to have given a competitive advantage to Google and
other successful dot-com companies.
</p>

<p>
In this environment, social media start-ups took took centre
stage. Following on from the examples of their predecessors, these
companies took for granted that they were to operate on very large
data sets. They inherited a very good set of scalable tools, but found
that much still had to be built on top. Unlike their predecessors,
many chose to do some or all of the infrastructure work out in the
open, joining or creating new communities around the tools. This was
in no small part due to the scarcity of funds, which encouraged
collaboration.
</p>

<p>
The social media start-ups soon found themselves locked in an arms
race for size, where the biggest would be the winner and all others
would be doomed to irrelevance<label for="5" class="margin-toggle sidenote-number"></label><input type="checkbox" id="5" class="margin-toggle"/><span class="sidenote">
Twitter, Facebook, YouTube, LinkedIn and the like were the
victors, but for every victor, a worthwhile foe was defeated; MySpace,
Hi5, Orkut and many others were all very popular at one time but lost
the war and faded into obscurity.
</span>. The size of the user base of the
successful companies exploded<label for="6" class="margin-toggle sidenote-number"></label><input type="checkbox" id="6" class="margin-toggle"/><span class="sidenote">
As an example, the number of Facebook users grew at an
exponential rate between 2004 and 2013 - see Facebook: 10 years of
social networking, in numbers.
</span>, and the tooling required to
manage such incredibly large volumes of data had to improve at the
same pace or faster. Interestingly, these start-ups continued to view
in-house code largely as a cost, not an asset, even after they started
to bring in large revenue. The size of the secret sauce was to be kept
at a minimum and the pace of open sourcing accelerated over
time<label for="7" class="margin-toggle sidenote-number"></label><input type="checkbox" id="7" class="margin-toggle"/><span class="sidenote">
A possible explanation for this decision is the need for
continuous scalability. Even companies as large as Facebook or Google
cannot dedicate the resources required to adequately maintain every
single tool they own; their code bases are just too large. At the same
time, they cannot afford for code to become stale because it must
continually withstand brutal scalability challenges. The solution to
this conundrum was to open source aggressively and to create vibrant
communities around tooling. Converting themselves to stewards of the
tools, they could now place quasi-skeleton crews to give direction to
development, and then rely on the swarms of new start-ups to
contribute patches. Once there are enough improvements, the latest
version of these tools can be incorporated into the internal
infrastructure. This proved to be a very cost-effective strategy, even
for large companies, and allowed continued investment across the
technology stack.
</span>.
</p>

<p>
A final factor was the rise of the next iteration of the data centre,
popularised by Amazon with AWS and EC2. It allowed any company to
scale out without ever having to concern themselves with physical
hardware. This was revolutionary because it allowed razor-thin costs
for scalability:
</p>

<ul class="org-ul">
<li><b>Pay only for what you use</b>: the elastic nature of EC2 meant that
one could grow or shrink one's cluster based on real time traffic
demands and availability of capital.</li>
<li><b>Zero-cost software</b>: FOSS was available in Amazon from the very
beginning and was extremely popular with start-ups.</li>
<li><b>Fully automated environments via APIs</b>: resource constrained
start-ups could now start to automate all aspects of the product
life-cycle. This meant they could release faster, which in turn
allowed them to fight more effectively for their user base. This
would in time become the DevOps movement.</li>
</ul>

<p>
By the end of the decade, the scalability tooling was largely
complete. It was now possible for a small start-up to create a small
website and to see it scale from hundreds to millions, restricted only
by their ability to bring in capital.
</p>
</div>
</div>
