nerd_food/start-ups_at_the_gate_trends_in_the_technology_industry.html

<div id="outline-container-orgc898a35" class="outline-2">
<h2 id="orgc898a35">Third Era: Mobile</h2>
<div class="outline-text-2" id="text-orgc898a35">
<p>
Mobile phones have been growing close to an exponential rate for over
two decades. However, the rise of the smart phones was a game changer,
and the line in the sand was drawn with the release of the
iPhone. What makes mobile so important to our story is it's
penetration. Until smart phones became ubiquitous, there was a large
segment of the population that was either totally inaccessible or
accessible for limited periods of time. With increasingly large
numbers of people carrying smart phones as they go about their day,
many use cases that were never before thought possible came to the
table. So whilst we call this "the Mobile era", the true heroes are
smart phones and, to a smaller extent, the tablets.
</p>

<p>
The mobile era started with simple apps. Smart phones were still new
and applications for each platform were novelty. There was a need to
reinvent all that existed before in the world of PCs and adapt it to
the new form factor. It was during this phase that the economies of
scale of mobile phones became obvious. Whereas consumer PC software
had prices on the range of tens to hundreds of dollars, mobile phones
bootstrapped a completely different pricing model, with many apps
selling for less than one dollar. Volume made up for the loss in
revenue per unit. The model was so incredibly successful that a
vibrant environment of apps sprung up around each of the successful
platforms, carefully nurtured by the companies running the show via
their app stores.
</p>

<p>
Soon enough the more complex apps came about. Companies like Four
Square and WhatsApp were trailblazers in the mobile space, merging it
with ideas from social media. Many others like Spotify took their
wares from the stagnant PC environment and moved to the ever growing
mobile space. Complex apps differed from the simple apps in that they
required large backends to manage operations. Since these companies
were cash strapped - a perennial condition of all start-ups - they
found themselves reusing all of the technology developed by the social
media companies and became part of the exact same landscape. Of
course, the social media companies were eventually forced to jump on
the mobile bandwagon - lest they got crushed by it.
</p>

<p>
So it was that the circle was closed between the three eras.
</p>
</div>
</div>

<div id="outline-container-orge73b1a7" class="outline-2">
<h2 id="orge73b1a7">Evolutionary Pressures and Auto-Catalytic Processes</h2>
<div class="outline-text-2" id="text-orge73b1a7">
<p>
The changes just described are so revolutionary that one cannot help
but look for models to approximate some kind of explanation for what
took place. Two stand out. The first is to imagine the population of
start-up companies as a small segment of the overall company
population that was submitted to an unbelievably harsh fitness
function: to grow the data volumes exponentially while growing costs
less than linearly. This filter generated new kinds of companies, new
kinds of technologies and new kinds of ways of managing technology.
</p>

<p>
Secondly, there is the auto-catalytic nature of the processes that
shaped the current technology landscape. Exponential growth tends to
have at its root this kind of self-reinforcing cycle, whereby
improvements in an area A trigger improvements in another area B,
which in turn forces A to improve. The process keeps on repeating
itself whilst it manages to retain stability.
</p>

<p>
It is this relationship we currently have between start-ups and FOSS:
the better the software gets, the cheaper it is to create new
start-ups and the faster these can grow with the same amount of
capital. By the same token, the more start-ups rely on FOSS, the more
they find themselves contributing back or else risk falling behind -
both technologically and cost-wise. This feedback loop is an emerging
property of the entire system and it has become extremely pronounced
over time.
</p>
</div>
</div>

<div id="outline-container-orgd5f22e9" class="outline-2">
<h2 id="orgd5f22e9">Finance and the Age of Disruption</h2>
<div class="outline-text-2" id="text-orgd5f22e9">
<p>
The concept of disruption was developed in the nineties by Clayton
Christensen in Innovator's Dilemma. This book has seen a resurgence in
popularity as well as in criticism<label for="8" class="margin-toggle sidenote-number"></label><input type="checkbox" id="8" class="margin-toggle"/><span class="sidenote">
8 There are quite a few to choose from but Lepore's is one of
the best because it robustly attacks both the ideology and the quality
of the data.
</span>. For good or bad, the ideas
in this book became the intellectual underpinnings of a new generation
of start-ups.
</p>

<p>
They seek to combine all of the advances of the previous start-ups to
create solutions to problems far outside the traditional IT
realm. Examples are the hotel industry (AirBnB), the taxi industry
(Uber, Lyft) and even the banking industry (Simple). Whilst it's still
early days, and whilst there have been many teething problems such as
issues with regulation, the destination of travel is already clear:
there will be more and more start-ups following the disruptive route.
</p>

<p>
What makes these companies a compelling proposition to VCs is that
they are willing to take on established concerns, with cost structures
that are orders of magnitude larger than that of these
start-ups. Their thinking is two-fold: the established companies are
leaving a lot of money on the table, consumed by their inefficiency;
and they are not exploiting the opportunities to their full potential
because they do not understand how to operate at a vast scale.
</p>

<p>
It is in this context that finance scene comes into the picture - as
part of the expansionary movement of the disruption movement. VCs have
longed eyed enviously the financial industry because they believed
that the problems being solved in trading are not that dissimilar to
those faced by many large scale start-ups. And yet the rewards are
disproportional large in Finance, when compared with say social media.
</p>

<p>
Fintech soon emerged. As applied to start-ups, Fintech is the umbrella
name given to the ecosystem of start-ups and VCs that focus
specifically on financial technology. This ecosystem has grown from
930M USD in 2008 to around 3Bn in 2013 according to Accenture. Centred
mainly in London, but with smaller offshoots in other financial
centres, the Fintech scene is starting to attract established players
in the world of Finance. For instance, Barclays has joined the fray by
creating an incubator. They farmed off the work to a third-party (Tech
Stars) but allowed all the start-ups in the programme to have
unprecedented access to their Mobile APIs. Their target is to own the
next generation of financial applications on Mobile devices.
</p>

<p>
Whist Barclays is disrupting from the outside, it is obvious that the
investment banking legacy platforms are a fertile ground for
start-ups. This is where the scalability stack has a near-perfect
fit. A typical example is OpenGamma. The start-up designed an open
source Risk platform, initially focused on back office use. They have
received over 20M USD in funding as of 2014 and have already been the
recipient of several of the industry's awards. There are now several
open source trading platforms to choose from including TradeLink and
OpenGamma, as well as the popular quantitative analytics library
QuantLib.
</p>

<p>
As we have seen in the previous sections, there is an auto-catalytic
process at play here. Once source code becomes widely available, the
cost of creating the next Financial startup goes down dramatically
because they can reuse the tools. This in turn means many more
start-ups will emerge, thus improving the general quality of the
publicly available source code.
</p>
</div>
</div>
